public class Main {
    public static void main(String[] args) {
        /*
        * идеи:
        * 1. Режимы игры: простой, настраиваемый..
        * 2. Размер карты: быстрая, долгая..
        * 3. Существа:
        *   Хищники - нужно много есть, чтобы размножаться, маленькое потомство, долго живут (едят друг друга при голодании)
        *   Травоядные - низкий пород голода для размножения, большое потомство, быстро стареют
        *   Деревья - медленно размножаются (рандомно вырастают, большой шанс вырасти на поле с могилой)
        * 4.
        * 5. Конец игры: один из вида существ вымер.
        * */

        // Вид карты (выбрал иероглифы из-за одинаковой длины символов, нет проблем с кодировкой)
        System.out.println("灬灬灬灬灬灬孕灬灬灬灬灬灬灬");
        System.out.println("灬灬孕灬灬土灬灬灬灬灬灬乂丅");
        System.out.println("灬灬灬灬圞圞灬灬灬乂灬灬灬灬");
        System.out.println("灬灬灬灬圞圞灬灬灬灬灬灬孕灬");
        System.out.println("灬灬孕灬灬灬灬孕灬灬灬灬灬灬");
        System.out.println("灬灬灬灬圞灬灬灬灬灬孕灬灬灬");
        System.out.println("灬灬灬灬孕灬灬灬灬灬灬孕灬灬");
    }
}
